In [46]:
import pandas as pd

data = pd.read_excel(r"Olympic 2012 Medal Tally.xlsx",skiprows=2)

In [47]:
data = pd.DataFrame(data)

In [48]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  0 non-null      float64
 1   Unnamed: 1  7 non-null      object
 2   Unnamed: 2  7 non-null      object
 3   Unnamed: 3  7 non-null      int64
 4   Gold        7 non-null      int64
 5   Silver      7 non-null      int64
 6   Bronze      7 non-null      int64
dtypes: float64(1), int64(4), object(2)
memory usage: 520.0+ bytes

In [49]:
data.drop(['Unnamed: 0'], axis=1, inplace=True)

In [50]:
data.index += 1

In [51]:
data = data.rename(columns={"Unnamed: 1": "Country", "Unnamed: 2": "Country Code","Unnamed: 3": "Olympics Year"})

In [52]:
data

         Country Country Code  Olympics Year  Gold  Silver  Bronze
1  Great Britain          GBR           2012    29      17      19
2         China           CHN           2012    38      28      22
3         Russia          RUS           2012    24      25      32
4  United States           US           2012    46      28      29
5          Korea          KOR           2012    13       8       7
6          Japan          JPN           2012     7      14      17
7        Germany          GER           2012    11      11      14

In [53]:
import numpy as np

In [54]:
max_gold = np.max(data['Gold'])

In [55]:
gold_max = data['Gold'].max()
gold_max

46

In [56]:
np_countries = np.array(data['Country'])
np_gold = np.array(data['Gold'])

In [57]:
max_gold = np_gold.argmax()

In [58]:
np_countries[max_gold] # Country with Max Gold Medals

'United States'

In [59]:
more_than_20 = np.argwhere(np_gold > 20)

In [60]:
np_countries[more_than_20] # Countries with more than 20 Gold Medals

array([['Great Britain'],
       ['China '],
       ['Russia'],
       ['United States']], dtype=object)

In [61]:
np_silver,np_bronze = np.array(data['Silver']), np.array(data['Bronze'])

In [62]:
total_medals = np_gold + np_silver + np_bronze
np.add(np_gold,np_silver,np_bronze)

array([46, 66, 49, 74, 21, 21, 22], dtype=int64)

In [63]:
total_medals_won = sum(data['Gold'] + data['Silver'] + data['Bronze'])

In [64]:
sum(total_medals) # Total amount of medals awarded

439

In [65]:
data['Total Medals Won'] = data['Gold'] + data['Silver'] + data['Bronze']

In [66]:
data

,Country,Country Code,Olympics Year,Gold,Silver,Bronze,Total Medals Won
1,Great Britain,GBR,2012,29,17,19,65
2,China,CHN,2012,38,28,22,88
3,Russia,RUS,2012,24,25,32,81
4,United States,US,2012,46,28,29,103
5,Korea,KOR,2012,13,8,7,28
6,Japan,JPN,2012,7,14,17,38
7,Germany,GER,2012,11,11,14,36

In [67]:
medal_won_total = np.array(data['Total Medals Won'])

In [68]:
medal_won_total

array([ 65,  88,  81, 103,  28,  38,  36], dtype=int64)

In [69]:
data[['Country','Total Medals Won']] # Number of Total Medals by Country

         Country  Total Medals Won
1  Great Britain                65
2         China                 88
3         Russia                81
4  United States               103
5          Korea                28
6          Japan                38
7        Germany                36

In [70]:
data

,Country,Country Code,Olympics Year,Gold,Silver,Bronze,Total Medals Won
1,Great Britain,GBR,2012,29,17,19,65
2,China,CHN,2012,38,28,22,88
3,Russia,RUS,2012,24,25,32,81
4,United States,US,2012,46,28,29,103
5,Korea,KOR,2012,13,8,7,28
6,Japan,JPN,2012,7,14,17,38
7,Germany,GER,2012,11,11,14,36

In [83]:
def continent(country):
    if country == 'Great Britain' or country == 'Russia' or country == 'Germany':
        return 'Europe'
    elif country == 'Korea' or country == 'Japan' or country == 'China ':
        return 'Asia'
    else:
        return 'North America'

In [84]:
data['Continent'] = data['Country'].copy()

In [88]:
continent('Canada')

'North America'

In [86]:
data['Continent'] = data['Continent'].map(continent)

In [87]:
data

,Country,Country Code,Olympics Year,Gold,Silver,Bronze,Total Medals Won,Continent
1,Great Britain,GBR,2012,29,17,19,65,Europe
2,China,CHN,2012,38,28,22,88,Asia
3,Russia,RUS,2012,24,25,32,81,Europe
4,United States,US,2012,46,28,29,103,North America
5,Korea,KOR,2012,13,8,7,28,Asia
6,Japan,JPN,2012,7,14,17,38,Asia
7,Germany,GER,2012,11,11,14,36,Europe